jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x21x1.cpp
#ifndef MC0
#define MC0 0x0010
#endif
#ifndef __msp430_headers_flash_h
#define __msp430_headers_flash_h 
#endif
#ifndef MC_UPDOWN
#define MC_UPDOWN MC_3
#endif
#ifndef __FLT_MIN__
#define __FLT_MIN__ 1.17549435e-38F
#endif
#ifndef __FLT_MIN_
#define __FLT_MIN_ 1.17549435e-38F
#endif
#ifndef P1IES_
#define P1IES_ 0x0024
#endif
#ifndef P1IES
#define P1IES 0x0024
#endif
#ifndef __ASSEMBLER__
#define __ASSEMBLER__ 1
#endif
#ifndef __ASSEMBLER_
#define __ASSEMBLER_ 1
#endif
#ifndef XTS
#define XTS 0x40
#endif
#ifndef __CHAR_BIT__
#define __CHAR_BIT__ 8
#endif
#ifndef __CHAR_BIT_
#define __CHAR_BIT_ 8
#endif
#ifndef __WINT_MAX__
#define __WINT_MAX__ 65535U
#endif
#ifndef __WINT_MAX_
#define __WINT_MAX_ 65535U
#endif
#ifndef TA0R_
#define TA0R_ 0x0170
#endif
#ifndef TA0R
#define TA0R 0x0170
#endif
#ifndef __SIZE_MAX__
#define __SIZE_MAX__ 65535U
#endif
#ifndef __SIZE_MAX_
#define __SIZE_MAX_ 65535U
#endif
#ifndef __WCHAR_MAX__
#define __WCHAR_MAX__ 32767
#endif
#ifndef __WCHAR_MAX_
#define __WCHAR_MAX_ 32767
#endif
#ifndef SEGWRT
#define SEGWRT 0x0080
#endif
#ifndef __FLT_EVAL_METHOD__
#define __FLT_EVAL_METHOD__ 0
#endif
#ifndef __FLT_EVAL_METHOD_
#define __FLT_EVAL_METHOD_ 0
#endif
#ifndef XT2OF
#define XT2OF 0x02
#endif
#ifndef __MSP430_HAS_FLASH2__
#define __MSP430_HAS_FLASH2__ 
#endif
#ifndef __MSP430_HAS_FLASH2_
#define __MSP430_HAS_FLASH2_ 
#endif
#ifndef FN0
#define FN0 0x0001
#endif
#ifndef FN1
#define FN1 0x0002
#endif
#ifndef FN2
#define FN2 0x0004
#endif
#ifndef FN3
#define FN3 0x0008
#endif
#ifndef FN4
#define FN4 0x0010
#endif
#ifndef FN5
#define FN5 0x0020
#endif
#ifndef SELS
#define SELS 0x08
#endif
#ifndef CM_BOTH
#define CM_BOTH CM_3
#endif
#ifndef CAIES
#define CAIES 0x04
#endif
#ifndef XT2S0
#define XT2S0 0x40
#endif
#ifndef XT2S1
#define XT2S1 0x80
#endif
#ifndef CAIFG
#define CAIFG 0x01
#endif
#ifndef __MSP430_HAS_PORT2_R__
#define __MSP430_HAS_PORT2_R__ 
#endif
#ifndef __MSP430_HAS_PORT2_R_
#define __MSP430_HAS_PORT2_R_ 
#endif
#ifndef __FINITE_MATH_ONLY__
#define __FINITE_MATH_ONLY__ 0
#endif
#ifndef __FINITE_MATH_ONLY_
#define __FINITE_MATH_ONLY_ 0
#endif
#ifndef CALDCO_12MHZ_
#define CALDCO_12MHZ_ 0x10FA
#endif
#ifndef CALDCO_12MHZ
#define CALDCO_12MHZ 0x10FA
#endif
#ifndef __GNUC_PATCHLEVEL__
#define __GNUC_PATCHLEVEL__ 3
#endif
#ifndef __GNUC_PATCHLEVEL_
#define __GNUC_PATCHLEVEL_ 3
#endif
#ifndef FSSEL0
#define FSSEL0 0x0040
#endif
#ifndef FSSEL1
#define FSSEL1 0x0080
#endif
#ifndef __DEC64_MAX_EXP__
#define __DEC64_MAX_EXP__ 385
#endif
#ifndef __DEC64_MAX_EXP_
#define __DEC64_MAX_EXP_ 385
#endif
#ifndef XCAP0
#define XCAP0 0x04
#endif
#ifndef XCAP1
#define XCAP1 0x08
#endif
#ifndef P2CA0
#define P2CA0 0x04
#endif
#ifndef P2CA1
#define P2CA1 0x08
#endif
#ifndef P2CA2
#define P2CA2 0x10
#endif
#ifndef P2CA3
#define P2CA3 0x20
#endif
#ifndef P2CA4
#define P2CA4 0x40
#endif
#ifndef CALDCO_8MHZ_
#define CALDCO_8MHZ_ 0x10FC
#endif
#ifndef CALDCO_8MHZ
#define CALDCO_8MHZ 0x10FC
#endif
#ifndef __SHRT_MAX__
#define __SHRT_MAX__ 32767
#endif
#ifndef __SHRT_MAX_
#define __SHRT_MAX_ 32767
#endif
#ifndef __LDBL_MAX__
#define __LDBL_MAX__ 3.40282347e+38L
#endif
#ifndef __LDBL_MAX_
#define __LDBL_MAX_ 3.40282347e+38L
#endif
#ifndef DIVA_DIV1
#define DIVA_DIV1 DIVA_0
#endif
#ifndef DIVA_DIV2
#define DIVA_DIV2 DIVA_1
#endif
#ifndef DIVA_DIV4
#define DIVA_DIV4 DIVA_2
#endif
#ifndef DIVA_DIV8
#define DIVA_DIV8 DIVA_3
#endif
#ifndef BIT0
#define BIT0 0x0001
#endif
#ifndef BIT1
#define BIT1 0x0002
#endif
#ifndef BIT2
#define BIT2 0x0004
#endif
#ifndef BIT3
#define BIT3 0x0008
#endif
#ifndef BIT4
#define BIT4 0x0010
#endif
#ifndef BIT5
#define BIT5 0x0020
#endif
#ifndef BIT7
#define BIT7 0x0080
#endif
#ifndef BIT8
#define BIT8 0x0100
#endif
#ifndef BIT9
#define BIT9 0x0200
#endif
#ifndef BITA
#define BITA 0x0400
#endif
#ifndef BITB
#define BITB 0x0800
#endif
#ifndef BITC
#define BITC 0x1000
#endif
#ifndef BITD
#define BITD 0x2000
#endif
#ifndef BITE
#define BITE 0x4000
#endif
#ifndef BITF
#define BITF 0x8000
#endif
#ifndef SELM_XT2CLK
#define SELM_XT2CLK SELM_2
#endif
#ifndef __UINTMAX_TYPE__
#define __UINTMAX_TYPE__ long long unsigned int
#endif
#ifndef __UINTMAX_TYPE_
#define __UINTMAX_TYPE_ long long unsigned int
#endif
#ifndef P2REN_
#define P2REN_ 0x002F
#endif
#ifndef P2REN
#define P2REN 0x002F
#endif
#ifndef WDTCNTCL
#define WDTCNTCL 0x0008
#endif
#ifndef __DEC32_EPSILON__
#define __DEC32_EPSILON__ 1E-6DF
#endif
#ifndef __DEC32_EPSILON_
#define __DEC32_EPSILON_ 1E-6DF
#endif
#ifndef TAIV_CCR2
#define TAIV_CCR2 0x04
#endif
#ifndef CCTL0_
#define CCTL0_ TA0CCTL0_
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef IE1_
#define IE1_ 0x0000
#endif
#ifndef IE1
#define IE1 0x0000
#endif
#ifndef CCTL1_
#define CCTL1_ TA0CCTL1_
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef __LDBL_MAX_EXP__
#define __LDBL_MAX_EXP__ 128
#endif
#ifndef __LDBL_MAX_EXP_
#define __LDBL_MAX_EXP_ 128
#endif
#ifndef CCTL2_
#define CCTL2_ TA0CCTL2_
#endif
#ifndef CCTL2
#define CCTL2 TA0CCTL2
#endif
#ifndef __WINT_MIN__
#define __WINT_MIN__ 0U
#endif
#ifndef __WINT_MIN_
#define __WINT_MIN_ 0U
#endif
#ifndef __MSP430_HAS_PORT1_R__
#define __MSP430_HAS_PORT1_R__ 
#endif
#ifndef __MSP430_HAS_PORT1_R_
#define __MSP430_HAS_PORT1_R_ 
#endif
#ifndef __SCHAR_MAX__
#define __SCHAR_MAX__ 127
#endif
#ifndef __SCHAR_MAX_
#define __SCHAR_MAX_ 127
#endif
#ifndef P2IFG_
#define P2IFG_ 0x002B
#endif
#ifndef P2IFG
#define P2IFG 0x002B
#endif
#ifndef TASSEL_ACLK
#define TASSEL_ACLK TASSEL_1
#endif
#ifndef TACTL_
#define TACTL_ TA0CTL_
#endif
#ifndef TACTL
#define TACTL TA0CTL_
#endif
#ifndef CCR0_
#define CCR0_ TA0CCR0_
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef __DBL_DIG__
#define __DBL_DIG__ 6
#endif
#ifndef __DBL_DIG_
#define __DBL_DIG_ 6
#endif
#ifndef CCR1_
#define CCR1_ TA0CCR1_
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef DCO0
#define DCO0 0x20
#endif
#ifndef DCO1
#define DCO1 0x40
#endif
#ifndef DCO2
#define DCO2 0x80
#endif
#ifndef CCR2_
#define CCR2_ TA0CCR2_
#endif
#ifndef CCR2
#define CCR2 TA0CCR2
#endif
#ifndef __SIZEOF_INT__
#define __SIZEOF_INT__ 2
#endif
#ifndef __SIZEOF_INT_
#define __SIZEOF_INT_ 2
#endif
#ifndef __SIZEOF_POINTER__
#define __SIZEOF_POINTER__ 2
#endif
#ifndef __SIZEOF_POINTER_
#define __SIZEOF_POINTER_ 2
#endif
#ifndef SELM0
#define SELM0 0x40
#endif
#ifndef SELM1
#define SELM1 0x80
#endif
#ifndef CAF
#define CAF 0x02
#endif
#ifndef CAP
#define CAP 0x0100
#endif
#ifndef __USER_LABEL_PREFIX__
#define __USER_LABEL_PREFIX__ 
#endif
#ifndef __USER_LABEL_PREFIX_
#define __USER_LABEL_PREFIX_ 
#endif
#ifndef CCI
#define CCI 0x0008
#endif
#ifndef __STDC_HOSTED__
#define __STDC_HOSTED__ 1
#endif
#ifndef __STDC_HOSTED_
#define __STDC_HOSTED_ 1
#endif
#ifndef __LDBL_HAS_INFINITY__
#define __LDBL_HAS_INFINITY__ 1
#endif
#ifndef __LDBL_HAS_INFINITY_
#define __LDBL_HAS_INFINITY_ 1
#endif
#ifndef OUTMOD_RESET_SET
#define OUTMOD_RESET_SET OUTMOD_7
#endif
#ifndef P1REN_
#define P1REN_ 0x0027
#endif
#ifndef P1REN
#define P1REN 0x0027
#endif
#ifndef TASSEL_TACLK
#define TASSEL_TACLK TASSEL_0
#endif
#ifndef ID_DIV1
#define ID_DIV1 ID_0
#endif
#ifndef ID_DIV2
#define ID_DIV2 ID_1
#endif
#ifndef ID_DIV4
#define ID_DIV4 ID_2
#endif
#ifndef ID_DIV8
#define ID_DIV8 ID_3
#endif
#ifndef TACLR
#define TACLR 0x0004
#endif
#ifndef __FLT_EPSILON__
#define __FLT_EPSILON__ 1.19209290e-7F
#endif
#ifndef __FLT_EPSILON_
#define __FLT_EPSILON_ 1.19209290e-7F
#endif
#ifndef MERAS
#define MERAS 0x0004
#endif
#ifndef __MSP430__
#define __MSP430__ 1
#endif
#ifndef __MSP430_
#define __MSP430_ 1
#endif
#ifndef __LDBL_MIN__
#define __LDBL_MIN__ 1.17549435e-38L
#endif
#ifndef __LDBL_MIN_
#define __LDBL_MIN_ 1.17549435e-38L
#endif
#ifndef CAEX
#define CAEX 0x80
#endif
#ifndef __MSP430_HAS_BC2__
#define __MSP430_HAS_BC2__ 
#endif
#ifndef __MSP430_HAS_BC2_
#define __MSP430_HAS_BC2_ 
#endif
#ifndef EMEX
#define EMEX 0x0020
#endif
#ifndef __DEC32_MAX__
#define __DEC32_MAX__ 9.999999E96DF
#endif
#ifndef __DEC32_MAX_
#define __DEC32_MAX_ 9.999999E96DF
#endif
#ifndef CM0
#define CM0 0x4000
#endif
#ifndef CM1
#define CM1 0x8000
#endif
#ifndef P1IFG_
#define P1IFG_ 0x0023
#endif
#ifndef P1IFG
#define P1IFG 0x0023
#endif
#ifndef CAIE
#define CAIE 0x02
#endif
#ifndef COV
#define COV 0x0002
#endif
#ifndef OUTMOD_TOGGLE
#define OUTMOD_TOGGLE OUTMOD_4
#endif
#ifndef TACTL
#define TACTL TA0CTL
#endif
#ifndef __SIZEOF_LONG__
#define __SIZEOF_LONG__ 4
#endif
#ifndef __SIZEOF_LONG_
#define __SIZEOF_LONG_ 4
#endif
#ifndef __DECIMAL_DIG__
#define __DECIMAL_DIG__ 9
#endif
#ifndef __DECIMAL_DIG_
#define __DECIMAL_DIG_ 9
#endif
#ifndef FWKEY
#define FWKEY 0xA500
#endif
#ifndef KEYV
#define KEYV 0x0002
#endif
#ifndef EPEXE
#define EPEXE 0x01
#endif
#ifndef CAON
#define CAON 0x08
#endif
#ifndef __LDBL_HAS_QUIET_NAN__
#define __LDBL_HAS_QUIET_NAN__ 1
#endif
#ifndef __LDBL_HAS_QUIET_NAN_
#define __LDBL_HAS_QUIET_NAN_ 1
#endif
#ifndef LOCK
#define LOCK 0x0010
#endif
#ifndef DIVM_DIV1
#define DIVM_DIV1 DIVM_0
#endif
#ifndef DIVM_DIV2
#define DIVM_DIV2 DIVM_1
#endif
#ifndef DIVM_DIV4
#define DIVM_DIV4 DIVM_2
#endif
#ifndef DIVM_DIV8
#define DIVM_DIV8 DIVM_3
#endif
#ifndef __GNUC__
#define __GNUC__ 4
#endif
#ifndef __GNUC_
#define __GNUC_ 4
#endif
#ifndef PORT2_VECTOR
#define PORT2_VECTOR 6
#endif
#ifndef __FLT_HAS_DENORM__
#define __FLT_HAS_DENORM__ 1
#endif
#ifndef __FLT_HAS_DENORM_
#define __FLT_HAS_DENORM_ 1
#endif
#ifndef __SIZEOF_LONG_DOUBLE__
#define __SIZEOF_LONG_DOUBLE__ 4
#endif
#ifndef __SIZEOF_LONG_DOUBLE_
#define __SIZEOF_LONG_DOUBLE_ 4
#endif
#ifndef FSSEL_0
#define FSSEL_0 0x0000
#endif
#ifndef FSSEL_1
#define FSSEL_1 0x0040
#endif
#ifndef FSSEL_2
#define FSSEL_2 0x0080
#endif
#ifndef FSSEL_3
#define FSSEL_3 0x00C0
#endif
#ifndef __BIGGEST_ALIGNMENT__
#define __BIGGEST_ALIGNMENT__ 2
#endif
#ifndef __BIGGEST_ALIGNMENT_
#define __BIGGEST_ALIGNMENT_ 2
#endif
#ifndef __DBL_HAS_INFINITY__
#define __DBL_HAS_INFINITY__ 1
#endif
#ifndef __DBL_HAS_INFINITY_
#define __DBL_HAS_INFINITY_ 1
#endif
#ifndef TACCR0_
#define TACCR0_ TA0CCR0_
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0_
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef GIE
#define GIE 0x0008
#endif
#ifndef FAIL
#define FAIL 0x0080
#endif
#ifndef TAIV
#define TAIV TA0IV
#endif
#ifndef TACCR1_
#define TACCR1_ TA0CCR1_
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1_
#endif
#ifndef P1DIR_
#define P1DIR_ 0x0022
#endif
#ifndef P1DIR
#define P1DIR 0x0022
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef BLKWRT
#define BLKWRT 0x0080
#endif
#ifndef TACCR2_
#define TACCR2_ TA0CCR2_
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2_
#endif
#ifndef MC_CONT
#define MC_CONT MC_2
#endif
#ifndef RSEL0
#define RSEL0 0x01
#endif
#ifndef RSEL1
#define RSEL1 0x02
#endif
#ifndef RSEL2
#define RSEL2 0x04
#endif
#ifndef RSEL3
#define RSEL3 0x08
#endif
#ifndef TAIV_NONE
#define TAIV_NONE 0x00
#endif
#ifndef __LDBL_HAS_DENORM__
#define __LDBL_HAS_DENORM__ 1
#endif
#ifndef __LDBL_HAS_DENORM_
#define __LDBL_HAS_DENORM_ 1
#endif
#ifndef __DEC128_MAX__
#define __DEC128_MAX__ 9.999999999999999999999999999999999E6144DL
#endif
#ifndef __DEC128_MAX_
#define __DEC128_MAX_ 9.999999999999999999999999999999999E6144DL
#endif
#ifndef __USING_SJLJ_EXCEPTIONS__
#define __USING_SJLJ_EXCEPTIONS__ 1
#endif
#ifndef __USING_SJLJ_EXCEPTIONS_
#define __USING_SJLJ_EXCEPTIONS_ 1
#endif
#ifndef __DEC32_MIN__
#define __DEC32_MIN__ 1E-95DF
#endif
#ifndef __DEC32_MIN_
#define __DEC32_MIN_ 1E-95DF
#endif
#ifndef TAR_
#define TAR_ TA0R_
#endif
#ifndef TAR
#define TAR TA0R_
#endif
#ifndef __DBL_MAX_EXP__
#define __DBL_MAX_EXP__ 128
#endif
#ifndef __DBL_MAX_EXP_
#define __DBL_MAX_EXP_ 128
#endif
#ifndef EEIEX
#define EEIEX 0x0010
#endif
#ifndef __DEC128_EPSILON__
#define __DEC128_EPSILON__ 1E-33DL
#endif
#ifndef __DEC128_EPSILON_
#define __DEC128_EPSILON_ 1E-33DL
#endif
#ifndef CALDCO_1MHZ_
#define CALDCO_1MHZ_ 0x10FE
#endif
#ifndef CALDCO_1MHZ
#define CALDCO_1MHZ 0x10FE
#endif
#ifndef __PTRDIFF_MAX__
#define __PTRDIFF_MAX__ 2147483647L
#endif
#ifndef __PTRDIFF_MAX_
#define __PTRDIFF_MAX_ 2147483647L
#endif
#ifndef __MSP430_HAS_WDT__
#define __MSP430_HAS_WDT__ 
#endif
#ifndef __MSP430_HAS_WDT_
#define __MSP430_HAS_WDT_ 
#endif
#ifndef TA0CTL_
#define TA0CTL_ 0x0160
#endif
#ifndef TA0CTL
#define TA0CTL 0x0160
#endif
#ifndef __LONG_LONG_MAX__
#define __LONG_LONG_MAX__ 9223372036854775807LL
#endif
#ifndef __LONG_LONG_MAX_
#define __LONG_LONG_MAX_ 9223372036854775807LL
#endif
#ifndef __SIZEOF_SIZE_T__
#define __SIZEOF_SIZE_T__ 2
#endif
#ifndef __SIZEOF_SIZE_T_
#define __SIZEOF_SIZE_T_ 2
#endif
#ifndef OUTMOD0
#define OUTMOD0 0x0020
#endif
#ifndef OUTMOD1
#define OUTMOD1 0x0040
#endif
#ifndef OUTMOD2
#define OUTMOD2 0x0080
#endif
#ifndef MSP430_NO_HWMUL
#define MSP430_NO_HWMUL 1
#endif
#ifndef WAIT
#define WAIT 0x0008
#endif
#ifndef __SIZEOF_WINT_T__
#define __SIZEOF_WINT_T__ 2
#endif
#ifndef __SIZEOF_WINT_T_
#define __SIZEOF_WINT_T_ 2
#endif
#ifndef FSSEL_ACLK
#define FSSEL_ACLK FSSEL_0
#endif
#ifndef DIVA0
#define DIVA0 0x10
#endif
#ifndef DIVA1
#define DIVA1 0x20
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 1002
#endif
#ifndef BIT6
#define BIT6 0x0040
#endif
#ifndef __msp430_headers_timera_h__
#define __msp430_headers_timera_h__ 
#endif
#ifndef __msp430_headers_timera_h_
#define __msp430_headers_timera_h_ 
#endif
#ifndef TASSEL0
#define TASSEL0 0x0100
#endif
#ifndef TASSEL1
#define TASSEL1 0x0200
#endif
#ifndef TASSEL2
#define TASSEL2 0x0400
#endif
#ifndef P1IE_
#define P1IE_ 0x0025
#endif
#ifndef P1IE
#define P1IE 0x0025
#endif
#ifndef BUSY
#define BUSY 0x0001
#endif
#ifndef TA0IV_
#define TA0IV_ 0x012E
#endif
#ifndef TA0IV
#define TA0IV 0x012E
#endif
#ifndef MC_STOP
#define MC_STOP MC_0
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef CACTL1_
#define CACTL1_ 0x0059
#endif
#ifndef CACTL1
#define CACTL1 0x0059
#endif
#ifndef __MSP430_IVCNT__
#define __MSP430_IVCNT__ 16
#endif
#ifndef __MSP430_IVCNT_
#define __MSP430_IVCNT_ 16
#endif
#ifndef WDTSSEL
#define WDTSSEL 0x0004
#endif
#ifndef FCTL1_
#define FCTL1_ 0x0128
#endif
#ifndef FCTL1
#define FCTL1 0x0128
#endif
#ifndef WDTIS_0
#define WDTIS_0 0x0000
#endif
#ifndef WDTIS_1
#define WDTIS_1 0x0001
#endif
#ifndef WDTIS_2
#define WDTIS_2 0x0002
#endif
#ifndef WDTIS_3
#define WDTIS_3 0x0003
#endif
#ifndef FCTL2_
#define FCTL2_ 0x012A
#endif
#ifndef FCTL2
#define FCTL2 0x012A
#endif
#ifndef CALBC1_1MHZ_
#define CALBC1_1MHZ_ 0x10FF
#endif
#ifndef CALBC1_1MHZ
#define CALBC1_1MHZ 0x10FF
#endif
#ifndef FCTL3_
#define FCTL3_ 0x012C
#endif
#ifndef FCTL3
#define FCTL3 0x012C
#endif
#ifndef P1IN_
#define P1IN_ 0x0020
#endif
#ifndef P1IN
#define P1IN 0x0020
#endif
#ifndef DIVM0
#define DIVM0 0x10
#endif
#ifndef DIVM1
#define DIVM1 0x20
#endif
#ifndef DCOCTL_
#define DCOCTL_ 0x0056
#endif
#ifndef DCOCTL
#define DCOCTL 0x0056
#endif
#ifndef CPUOFF
#define CPUOFF 0x0010
#endif
#ifndef WDTNMIES
#define WDTNMIES 0x0040
#endif
#ifndef __DEC128_MIN__
#define __DEC128_MIN__ 1E-6143DL
#endif
#ifndef __DEC128_MIN_
#define __DEC128_MIN_ 1E-6143DL
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef __REGISTER_PREFIX_
#define __REGISTER_PREFIX_ 
#endif
#ifndef __DBL_HAS_DENORM__
#define __DBL_HAS_DENORM__ 1
#endif
#ifndef __DBL_HAS_DENORM_
#define __DBL_HAS_DENORM_ 1
#endif
#ifndef P2OUT_
#define P2OUT_ 0x0029
#endif
#ifndef P2OUT
#define P2OUT 0x0029
#endif
#ifndef PORT1_VECTOR
#define PORT1_VECTOR 4
#endif
#ifndef FRKEY
#define FRKEY 0x9600
#endif
#ifndef __MSP430_HAS_TA3__
#define __MSP430_HAS_TA3__ 
#endif
#ifndef __MSP430_HAS_TA3_
#define __MSP430_HAS_TA3_ 
#endif
#ifndef DIVS0
#define DIVS0 0x02
#endif
#ifndef DIVS1
#define DIVS1 0x04
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef __NO_INLINE_
#define __NO_INLINE_ 1
#endif
#ifndef SCCI
#define SCCI 0x0400
#endif
#ifndef P2SEL_
#define P2SEL_ 0x002E
#endif
#ifndef P2SEL
#define P2SEL 0x002E
#endif
#ifndef __FLT_MANT_DIG__
#define __FLT_MANT_DIG__ 24
#endif
#ifndef __FLT_MANT_DIG_
#define __FLT_MANT_DIG_ 24
#endif
#ifndef __VERSION__
#define __VERSION__ "4.5.3"
#endif
#ifndef __VERSION_
#define __VERSION_ "4.5.3"
#endif
#ifndef WDTCTL_
#define WDTCTL_ 0x0120
#endif
#ifndef WDTCTL
#define WDTCTL 0x0120
#endif
#ifndef SCG0
#define SCG0 0x0040
#endif
#ifndef SCG1
#define SCG1 0x0080
#endif
#ifndef LFXT1OF
#define LFXT1OF 0x01
#endif
#ifndef TA0CCTL0_
#define TA0CCTL0_ 0x0162
#endif
#ifndef TA0CCTL0
#define TA0CCTL0 0x0162
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef TA0CCTL1_
#define TA0CCTL1_ 0x0164
#endif
#ifndef TA0CCTL1
#define TA0CCTL1 0x0164
#endif
#ifndef CAREF_0
#define CAREF_0 0x00
#endif
#ifndef CAREF_1
#define CAREF_1 0x10
#endif
#ifndef CAREF_2
#define CAREF_2 0x20
#endif
#ifndef CAREF_3
#define CAREF_3 0x30
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef __IOMACROS_H
#define __IOMACROS_H 
#endif
#ifndef TA0CCTL2_
#define TA0CCTL2_ 0x0166
#endif
#ifndef TA0CCTL2
#define TA0CCTL2 0x0166
#endif
#ifndef __msp430_headers_common_h
#define __msp430_headers_common_h 
#endif
#ifndef LFXT1S0
#define LFXT1S0 0x10
#endif
#ifndef LFXT1S1
#define LFXT1S1 0x20
#endif
#ifndef CARSEL
#define CARSEL 0x40
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2
#endif
#ifndef P1OUT_
#define P1OUT_ 0x0021
#endif
#ifndef P1OUT
#define P1OUT 0x0021
#endif
#ifndef __DEC64_EPSILON__
#define __DEC64_EPSILON__ 1E-15DD
#endif
#ifndef __DEC64_EPSILON_
#define __DEC64_EPSILON_ 1E-15DD
#endif
#ifndef CALBC1_16MHZ_
#define CALBC1_16MHZ_ 0x10F9
#endif
#ifndef CALBC1_16MHZ
#define CALBC1_16MHZ 0x10F9
#endif
#ifndef P1SEL_
#define P1SEL_ 0x0026
#endif
#ifndef P1SEL
#define P1SEL 0x0026
#endif
#ifndef OUT
#define OUT 0x0004
#endif
#ifndef CM_POS
#define CM_POS CM_1
#endif
#ifndef FSSEL_SMCLK
#define FSSEL_SMCLK FSSEL_2
#endif
#ifndef TASSEL_SMCLK
#define TASSEL_SMCLK TASSEL_2
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef __SIZE_TYPE_
#define __SIZE_TYPE_ unsigned int
#endif
#ifndef SCS
#define SCS 0x0800
#endif
#ifndef LPM0
#define LPM0 CPUOFF
#endif
#ifndef LPM1
#define LPM1 SCG0+CPUOFF
#endif
#ifndef LPM2
#define LPM2 SCG1+CPUOFF
#endif
#ifndef LPM3
#define LPM3 SCG1+SCG0+CPUOFF
#endif
#ifndef LPM4
#define LPM4 SCG1+SCG0+OSCOFF+CPUOFF
#endif
#ifndef __msp430x21x1
#define __msp430x21x1 
#endif
#ifndef __msp430_headers_eprom_h
#define __msp430_headers_eprom_h 
#endif
#ifndef SELM_LFXTCLK
#define SELM_LFXTCLK SELM_3
#endif
#ifndef __FLT_RADIX__
#define __FLT_RADIX__ 2
#endif
#ifndef __FLT_RADIX_
#define __FLT_RADIX_ 2
#endif
#ifndef __LDBL_EPSILON__
#define __LDBL_EPSILON__ 1.19209290e-7L
#endif
#ifndef __LDBL_EPSILON_
#define __LDBL_EPSILON_ 1.19209290e-7L
#endif
#ifndef OUTMOD_RESET
#define OUTMOD_RESET OUTMOD_5
#endif
#ifndef ACCVIFG
#define ACCVIFG 0x0004
#endif
#ifndef __msp430_headers_clock_h
#define __msp430_headers_clock_h 
#endif
#ifndef P2DIR_
#define P2DIR_ 0x002A
#endif
#ifndef P2DIR
#define P2DIR 0x002A
#endif
#ifndef CM_NEG
#define CM_NEG CM_2
#endif
#ifndef __SIZEOF_PTRDIFF_T__
#define __SIZEOF_PTRDIFF_T__ 4
#endif
#ifndef __SIZEOF_PTRDIFF_T_
#define __SIZEOF_PTRDIFF_T_ 4
#endif
#ifndef FXKEY
#define FXKEY 0x3300
#endif
#ifndef EPCTL_
#define EPCTL_ 0x0054
#endif
#ifndef EPCTL
#define EPCTL 0x0054
#endif
#ifndef MOD0
#define MOD0 0x01
#endif
#ifndef MOD1
#define MOD1 0x02
#endif
#ifndef MOD2
#define MOD2 0x04
#endif
#ifndef MOD3
#define MOD3 0x08
#endif
#ifndef MOD4
#define MOD4 0x10
#endif
#ifndef __DEC32_SUBNORMAL_MIN__
#define __DEC32_SUBNORMAL_MIN__ 0.000001E-95DF
#endif
#ifndef __DEC32_SUBNORMAL_MIN_
#define __DEC32_SUBNORMAL_MIN_ 0.000001E-95DF
#endif
#ifndef NMI_VECTOR
#define NMI_VECTOR 28
#endif
#ifndef TAIV_CCR1
#define TAIV_CCR1 0x02
#endif
#ifndef __MSP430F110__
#define __MSP430F110__ 1
#endif
#ifndef __MSP430F110_
#define __MSP430F110_ 1
#endif
#ifndef __FLT_HAS_QUIET_NAN__
#define __FLT_HAS_QUIET_NAN__ 1
#endif
#ifndef __FLT_HAS_QUIET_NAN_
#define __FLT_HAS_QUIET_NAN_ 1
#endif
#ifndef __FLT_MAX_10_EXP__
#define __FLT_MAX_10_EXP__ 38
#endif
#ifndef __FLT_MAX_10_EXP_
#define __FLT_MAX_10_EXP_ 38
#endif
#ifndef __LONG_MAX__
#define __LONG_MAX__ 2147483647L
#endif
#ifndef __LONG_MAX_
#define __LONG_MAX_ 2147483647L
#endif
#ifndef __DEC128_SUBNORMAL_MIN__
#define __DEC128_SUBNORMAL_MIN__ 0.000000000000000000000000000000001E-6143DL
#endif
#ifndef __DEC128_SUBNORMAL_MIN_
#define __DEC128_SUBNORMAL_MIN_ 0.000000000000000000000000000000001E-6143DL
#endif
#ifndef __FLT_HAS_INFINITY__
#define __FLT_HAS_INFINITY__ 1
#endif
#ifndef __FLT_HAS_INFINITY_
#define __FLT_HAS_INFINITY_ 1
#endif
#ifndef TASSEL_INCLK
#define TASSEL_INCLK TASSEL_3
#endif
#ifndef __DEC64_MAX__
#define __DEC64_MAX__ 9.999999999999999E384DD
#endif
#ifndef __DEC64_MAX_
#define __DEC64_MAX_ 9.999999999999999E384DD
#endif
#ifndef TIMERA1_VECTOR
#define TIMERA1_VECTOR 16
#endif
#ifndef __CHAR16_TYPE__
#define __CHAR16_TYPE__ short unsigned int
#endif
#ifndef __CHAR16_TYPE_
#define __CHAR16_TYPE_ short unsigned int
#endif
#ifndef TA0CCR0_
#define TA0CCR0_ 0x0172
#endif
#ifndef TA0CCR0
#define TA0CCR0 0x0172
#endif
#ifndef __PRAGMA_REDEFINE_EXTNAME
#define __PRAGMA_REDEFINE_EXTNAME 1
#endif
#ifndef WDTNMI
#define WDTNMI 0x0020
#endif
#ifndef TA0CCR1_
#define TA0CCR1_ 0x0174
#endif
#ifndef TA0CCR1
#define TA0CCR1 0x0174
#endif
#ifndef OUTMOD_OUT
#define OUTMOD_OUT OUTMOD_0
#endif
#ifndef __DEC64_MANT_DIG__
#define __DEC64_MANT_DIG__ 16
#endif
#ifndef __DEC64_MANT_DIG_
#define __DEC64_MANT_DIG_ 16
#endif
#ifndef TA0CCR2_
#define TA0CCR2_ 0x0176
#endif
#ifndef TA0CCR2
#define TA0CCR2 0x0176
#endif
#ifndef FSSEL_MCLK
#define FSSEL_MCLK FSSEL_1
#endif
#ifndef WDT_VECTOR
#define WDT_VECTOR 20
#endif
#ifndef __DEC32_MAX_EXP__
#define __DEC32_MAX_EXP__ 97
#endif
#ifndef __DEC32_MAX_EXP_
#define __DEC32_MAX_EXP_ 97
#endif
#ifndef XT2OFF
#define XT2OFF 0x80
#endif
#ifndef OUTMOD_SET
#define OUTMOD_SET OUTMOD_1
#endif
#ifndef CAREF_VT
#define CAREF_VT CAREF_3
#endif
#ifndef __LDBL_MANT_DIG__
#define __LDBL_MANT_DIG__ 24
#endif
#ifndef __LDBL_MANT_DIG_
#define __LDBL_MANT_DIG_ 24
#endif
#ifndef __DBL_HAS_QUIET_NAN__
#define __DBL_HAS_QUIET_NAN__ 1
#endif
#ifndef __DBL_HAS_QUIET_NAN_
#define __DBL_HAS_QUIET_NAN_ 1
#endif
#ifndef __WCHAR_TYPE__
#define __WCHAR_TYPE__ int
#endif
#ifndef __WCHAR_TYPE_
#define __WCHAR_TYPE_ int
#endif
#ifndef __SIZEOF_FLOAT__
#define __SIZEOF_FLOAT__ 4
#endif
#ifndef __SIZEOF_FLOAT_
#define __SIZEOF_FLOAT_ 4
#endif
#ifndef OUTMOD_TOGGLE_RESET
#define OUTMOD_TOGGLE_RESET OUTMOD_2
#endif
#ifndef WRT
#define WRT 0x0040
#endif
#ifndef CAREF_025
#define CAREF_025 CAREF_1
#endif
#ifndef WDTPW
#define WDTPW 0x5A00
#endif
#ifndef CAREF0
#define CAREF0 0x10
#endif
#ifndef CAREF1
#define CAREF1 0x20
#endif
#ifndef __FLT_DIG__
#define __FLT_DIG__ 6
#endif
#ifndef __FLT_DIG_
#define __FLT_DIG_ 6
#endif
#ifndef __MSPGCC__
#define __MSPGCC__ 20110706
#endif
#ifndef __MSPGCC_
#define __MSPGCC_ 20110706
#endif
#ifndef CAREF_050
#define CAREF_050 CAREF_2
#endif
#ifndef EEI
#define EEI 0x0008
#endif
#ifndef __INT_MAX__
#define __INT_MAX__ 32767
#endif
#ifndef __INT_MAX_
#define __INT_MAX_ 32767
#endif
#ifndef WDTTMSEL
#define WDTTMSEL 0x0010
#endif
#ifndef BCSCTL1_
#define BCSCTL1_ 0x0057
#endif
#ifndef BCSCTL1
#define BCSCTL1 0x0057
#endif
#ifndef BCSCTL2_
#define BCSCTL2_ 0x0058
#endif
#ifndef BCSCTL2
#define BCSCTL2 0x0058
#endif
#ifndef P2IE_
#define P2IE_ 0x002D
#endif
#ifndef P2IE
#define P2IE 0x002D
#endif
#ifndef BCSCTL3_
#define BCSCTL3_ 0x0053
#endif
#ifndef BCSCTL3
#define BCSCTL3 0x0053
#endif
#ifndef __FLT_MAX_EXP__
#define __FLT_MAX_EXP__ 128
#endif
#ifndef __FLT_MAX_EXP_
#define __FLT_MAX_EXP_ 128
#endif
#ifndef __DBL_MANT_DIG__
#define __DBL_MANT_DIG__ 24
#endif
#ifndef __DBL_MANT_DIG_
#define __DBL_MANT_DIG_ 24
#endif
#ifndef BSLSKEY_
#define BSLSKEY_ 0xFFDE
#endif
#ifndef BSLSKEY
#define BSLSKEY 0xFFDE
#endif
#ifndef __DEC64_MIN__
#define __DEC64_MIN__ 1E-383DD
#endif
#ifndef __DEC64_MIN_
#define __DEC64_MIN_ 1E-383DD
#endif
#ifndef __WINT_TYPE__
