jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x21x1.cpp
#define __WINT_TYPE__ unsigned int
#endif
#ifndef __WINT_TYPE_
#define __WINT_TYPE_ unsigned int
#endif
#ifndef __SIZEOF_SHORT__
#define __SIZEOF_SHORT__ 2
#endif
#ifndef __SIZEOF_SHORT_
#define __SIZEOF_SHORT_ 2
#endif
#ifndef CAOUT
#define CAOUT 0x01
#endif
#ifndef SELM_DCOCLK
#define SELM_DCOCLK SELM_0
#endif
#ifndef __msp430_headers_gpio_h
#define __msp430_headers_gpio_h 
#endif
#ifndef CALDCO_16MHZ_
#define CALDCO_16MHZ_ 0x10F8
#endif
#ifndef CALDCO_16MHZ
#define CALDCO_16MHZ 0x10F8
#endif
#ifndef IFG1_
#define IFG1_ 0x0002
#endif
#ifndef IFG1
#define IFG1 0x0002
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef CCIE
#define CCIE 0x0010
#endif
#ifndef LOCKA
#define LOCKA 0x0040
#endif
#ifndef CACTL2_
#define CACTL2_ 0x005A
#endif
#ifndef CACTL2
#define CACTL2 0x005A
#endif
#ifndef __LDBL_MAX_10_EXP__
#define __LDBL_MAX_10_EXP__ 38
#endif
#ifndef __LDBL_MAX_10_EXP_
#define __LDBL_MAX_10_EXP_ 38
#endif
#ifndef P2IN_
#define P2IN_ 0x0028
#endif
#ifndef P2IN
#define P2IN 0x0028
#endif
#ifndef BSLSKEY_DISABLE
#define BSLSKEY_DISABLE 0xAA55
#endif
#ifndef __SIZEOF_WCHAR_T__
#define __SIZEOF_WCHAR_T__ 2
#endif
#ifndef __SIZEOF_WCHAR_T_
#define __SIZEOF_WCHAR_T_ 2
#endif
#ifndef OUTMOD_SET_RESET
#define OUTMOD_SET_RESET OUTMOD_3
#endif
#ifndef OUTMOD_TOGGLE_SET
#define OUTMOD_TOGGLE_SET OUTMOD_6
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef CCTL2
#define CCTL2 TA0CCTL2
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef CCR2
#define CCR2 TA0CCR2
#endif
#ifndef TAIFG
#define TAIFG 0x0001
#endif
#ifndef ID0
#define ID0 0x0040
#endif
#ifndef ID1
#define ID1 0x0080
#endif
#ifndef CCIS0
#define CCIS0 0x1000
#endif
#ifndef CCIS1
#define CCIS1 0x2000
#endif
#ifndef TAR
#define TAR TA0R
#endif
#ifndef CALBC1_12MHZ_
#define CALBC1_12MHZ_ 0x10FB
#endif
#ifndef CALBC1_12MHZ
#define CALBC1_12MHZ 0x10FB
#endif
#ifndef TIMERA0_VECTOR
#define TIMERA0_VECTOR 18
#endif
#ifndef __DEC_EVAL_METHOD__
#define __DEC_EVAL_METHOD__ 2
#endif
#ifndef __DEC_EVAL_METHOD_
#define __DEC_EVAL_METHOD_ 2
#endif
#ifndef DIVS_DIV1
#define DIVS_DIV1 DIVS_0
#endif
#ifndef DIVS_DIV2
#define DIVS_DIV2 DIVS_1
#endif
#ifndef DIVS_DIV4
#define DIVS_DIV4 DIVS_2
#endif
#ifndef DIVS_DIV8
#define DIVS_DIV8 DIVS_3
#endif
#ifndef BSLSKEY_NO_ERASE
#define BSLSKEY_NO_ERASE 0x0000
#endif
#ifndef CAREF_OFF
#define CAREF_OFF CAREF_0
#endif
#ifndef ERASE
#define ERASE 0x0002
#endif
#ifndef __MSP430_HAS_CAPLUS__
#define __MSP430_HAS_CAPLUS__ 
#endif
#ifndef __MSP430_HAS_CAPLUS_
#define __MSP430_HAS_CAPLUS_ 
#endif
#ifndef __INTMAX_MAX__
#define __INTMAX_MAX__ 9223372036854775807LL
#endif
#ifndef __INTMAX_MAX_
#define __INTMAX_MAX_ 9223372036854775807LL
#endif
#ifndef __FLT_DENORM_MIN__
#define __FLT_DENORM_MIN__ 1.40129846e-45F
#endif
#ifndef __FLT_DENORM_MIN_
#define __FLT_DENORM_MIN_ 1.40129846e-45F
#endif
#ifndef __CHAR32_TYPE__
#define __CHAR32_TYPE__ unsigned int
#endif
#ifndef __CHAR32_TYPE_
#define __CHAR32_TYPE_ unsigned int
#endif
#ifndef __FLT_MAX__
#define __FLT_MAX__ 3.40282347e+38F
#endif
#ifndef __FLT_MAX_
#define __FLT_MAX_ 3.40282347e+38F
#endif
#ifndef TAIV_
#define TAIV_ TA0IV_
#endif
#ifndef TAIV
#define TAIV TA0IV_
#endif
#ifndef __SIZEOF_DOUBLE__
#define __SIZEOF_DOUBLE__ 4
#endif
#ifndef __SIZEOF_DOUBLE_
#define __SIZEOF_DOUBLE_ 4
#endif
#ifndef WDTHOLD
#define WDTHOLD 0x0080
#endif
#ifndef __INTMAX_TYPE__
#define __INTMAX_TYPE__ long long int
#endif
#ifndef __INTMAX_TYPE_
#define __INTMAX_TYPE_ long long int
#endif
#ifndef __DEC128_MAX_EXP__
#define __DEC128_MAX_EXP__ 6145
#endif
#ifndef __DEC128_MAX_EXP_
#define __DEC128_MAX_EXP_ 6145
#endif
#ifndef __GNUC_MINOR__
#define __GNUC_MINOR__ 5
#endif
#ifndef __GNUC_MINOR_
#define __GNUC_MINOR_ 5
#endif
#ifndef __UINTMAX_MAX__
#define __UINTMAX_MAX__ 18446744073709551615ULL
#endif
#ifndef __UINTMAX_MAX_
#define __UINTMAX_MAX_ 18446744073709551615ULL
#endif
#ifndef CASHORT
#define CASHORT 0x80
#endif
#ifndef __DEC32_MANT_DIG__
#define __DEC32_MANT_DIG__ 7
#endif
#ifndef __DEC32_MANT_DIG_
#define __DEC32_MANT_DIG_ 7
#endif
#ifndef COMPARATORA_VECTOR
#define COMPARATORA_VECTOR 22
#endif
#ifndef __DBL_MAX_10_EXP__
#define __DBL_MAX_10_EXP__ 38
#endif
#ifndef __DBL_MAX_10_EXP_
#define __DBL_MAX_10_EXP_ 38
#endif
#ifndef CALBC1_8MHZ_
#define CALBC1_8MHZ_ 0x10FD
#endif
#ifndef CALBC1_8MHZ
#define CALBC1_8MHZ 0x10FD
#endif
#ifndef __LDBL_DENORM_MIN__
#define __LDBL_DENORM_MIN__ 1.40129846e-45L
#endif
#ifndef __LDBL_DENORM_MIN_
#define __LDBL_DENORM_MIN_ 1.40129846e-45L
#endif
#ifndef TACCTL0_
#define TACCTL0_ TA0CCTL0_
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0_
#endif
#ifndef __STDC__
#define __STDC__ 1
#endif
#ifndef __STDC_
#define __STDC_ 1
#endif
#ifndef MC1
#define MC1 0x0020
#endif
#ifndef __PTRDIFF_TYPE__
#define __PTRDIFF_TYPE__ long int
#endif
#ifndef __PTRDIFF_TYPE_
#define __PTRDIFF_TYPE_ long int
#endif
#ifndef TACCTL1_
#define TACCTL1_ TA0CCTL1_
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1_
#endif
#ifndef TAIV_OVERFLOW
#define TAIV_OVERFLOW 0x0A
#endif
#ifndef P2IES_
#define P2IES_ 0x002C
#endif
#ifndef P2IES
#define P2IES 0x002C
#endif
#ifndef TACCTL2_
#define TACCTL2_ TA0CCTL2_
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2_
#endif
#ifndef MSP430
#define MSP430 1
#endif
#ifndef __msp430_headers_compa_h
#define __msp430_headers_compa_h 
#endif
#ifndef __DEC64_SUBNORMAL_MIN__
#define __DEC64_SUBNORMAL_MIN__ 0.000000000000001E-383DD
#endif
#ifndef __DEC64_SUBNORMAL_MIN_
#define __DEC64_SUBNORMAL_MIN_ 0.000000000000001E-383DD
#endif
#ifndef __DEC128_MANT_DIG__
#define __DEC128_MANT_DIG__ 34
#endif
#ifndef __DEC128_MANT_DIG_
#define __DEC128_MANT_DIG_ 34
#endif
#ifndef __MSP430_CPU__
#define __MSP430_CPU__ 0
#endif
#ifndef __MSP430_CPU_
#define __MSP430_CPU_ 0
#endif
#ifndef __SIZEOF_LONG_LONG__
#define __SIZEOF_LONG_LONG__ 8
#endif
#ifndef __SIZEOF_LONG_LONG_
#define __SIZEOF_LONG_LONG_ 8
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef __LDBL_DIG__
#define __LDBL_DIG__ 6
#endif
#ifndef __LDBL_DIG_
#define __LDBL_DIG_ 6
#endif
#ifndef OSCOFF
#define OSCOFF 0x0020
#endif
#ifndef __GNUC_GNU_INLINE__
#define __GNUC_GNU_INLINE__ 1
#endif
#ifndef __GNUC_GNU_INLINE_
#define __GNUC_GNU_INLINE_ 1
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2
#endif
#ifndef EPVPPS
#define EPVPPS 0x02
#endif
#ifndef CAPD0
#define CAPD0 0x01
#endif
#ifndef CAPD1
#define CAPD1 0x02
#endif
#ifndef CAPD2
#define CAPD2 0x04
#endif
#ifndef CAPD3
#define CAPD3 0x08
#endif
#ifndef CAPD4
#define CAPD4 0x10
#endif
#ifndef CAPD5
#define CAPD5 0x20
#endif
#ifndef CAPD6
#define CAPD6 0x40
#endif
#ifndef CAPD7
#define CAPD7 0x80
#endif
#ifndef C
#define C 0x0001
#endif
#ifndef N
#define N 0x0004
#endif
#ifndef CAPD_
#define CAPD_ 0x005B
#endif
#ifndef CAPD
#define CAPD 0x005B
#endif
#ifndef V
#define V 0x0100
#endif
#ifndef Z
#define Z 0x0002
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

class Variant_msp430x21x1 : public Variant {
	public:
		Variant_msp430x21x1() {}
		virtual ~Variant_msp430x21x1() {}
		const char *getName() { return "msp430x21x1"; }

		unsigned int getP1DIR() {
#ifdef P1DIR_
			return P1DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP1IE() {
#ifdef P1IE_
			return P1IE_;
#else
			return 0;
#endif
		}


